tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1786_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16F1786_H_
#define _PIC16F1786_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define DC                            6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define WREG                          21
#define WREG0                         22
#define PCLATH                        23
#define INTCON                        24
#define IOCIF                         25
#define INTF                          26
#define T0IF                          27
#define TMR0IF                        28
#define IOCIE                         29
#define INTE                          30
#define T0IE                          31
#define TMR0IE                        32
#define PEIE                          33
#define GIE                           34
#define PORTA                         35
#define RA0                           36
#define RA1                           37
#define RA2                           38
#define RA3                           39
#define RA4                           40
#define RA5                           41
#define RA6                           42
#define RA7                           43
#define PORTB                         44
#define RB0                           45
#define RB1                           46
#define RB2                           47
#define RB3                           48
#define RB4                           49
#define RB5                           50
#define RB6                           51
#define RB7                           52
#define RC0                           53
#define PORTC                         54
#define RC1                           55
#define RC2                           56
#define RC3                           57
#define RC4                           58
#define RC5                           59
#define RC6                           60
#define RC7                           61
#define PORTE                         62
#define RE3                           63
#define PIR1                          64
#define TMR1IF                        65
#define TMR2IF                        66
#define CCP1IF                        67
#define SSP1IF                        68
#define TXIF                          69
#define RCIF                          70
#define ADIF                          71
#define TMR1GIF                       72
#define PIR2                          73
#define CCP2IF                        74
#define C3IF                          75
#define C4IF                          76
#define BCL1IF                        77
#define EEIF                          78
#define C1IF                          79
#define C2IF                          80
#define OSFIF                         81
#define PIR3                          82
#define CCP3IF                        83
#define PIR4                          84
#define PSMC1SIF                      85
#define PSMC2SIF                      86
#define PSMC3SIF                      87
#define PSMC1TIF                      88
#define PSMC2TIF                      89
#define PSMC3TIF                      90
#define TMR0                          91
#define TMR1L                         92
#define TMR1H                         93
#define T1CON                         94
#define TMR1ON                        95
#define nT1SYNC                       96
#define T1OSCEN                       97
#define T1CKPS0                       98
#define T1CKPS                        99
#define T1CKPS1                       100
#define TMR1CS                        101
#define TMR1CS0                       102
#define TMR1CS1                       103
#define T1GCON                        104
#define T1GSS0                        105
#define T1GSS                         106
#define T1GSS1                        107
#define T1GVAL                        108
#define T1GGO                         109
#define T1GSPM                        110
#define T1GTM                         111
#define T1GPOL                        112
#define TMR1GE                        113
#define TMR2                          114
#define PR2                           115
#define T2CON                         116
#define T2CKPS0                       117
#define T2CKPS                        118
#define T2CKPS1                       119
#define TMR2ON                        120
#define T2OUTPS0                      121
#define T2OUTPS                       122
#define T2OUTPS1                      123
#define T2OUTPS2                      124
#define T2OUTPS3                      125
#define TRISA                         126
#define TRISA0                        127
#define TRISA1                        128
#define TRISA2                        129
#define TRISA3                        130
#define TRISA4                        131
#define TRISA5                        132
#define TRISA6                        133
#define TRISA7                        134
#define TRISB                         135
#define TRISB0                        136
#define TRISB1                        137
#define TRISB2                        138
#define TRISB3                        139
#define TRISB4                        140
#define TRISB5                        141
#define TRISB6                        142
#define TRISB7                        143
#define TRISC                         144
#define TRISC0                        145
#define TRISC1                        146
#define TRISC2                        147
#define TRISC3                        148
#define TRISC4                        149
#define TRISC5                        150
#define TRISC6                        151
#define TRISC7                        152
#define TRISE                         153
#define TRISE3                        154
#define PIE1                          155
#define TMR1IE                        156
#define TMR2IE                        157
#define CCP1IE                        158
#define SSP1IE                        159
#define TXIE                          160
#define RCIE                          161
#define ADIE                          162
#define TMR1GIE                       163
#define PIE2                          164
#define CCP2IE                        165
#define C3IE                          166
#define C4IE                          167
#define BCL1IE                        168
#define EEIE                          169
#define C1IE                          170
#define C2IE                          171
#define OSFIE                         172
#define PIE3                          173
#define CCP3IE                        174
#define PIE4                          175
#define PSMC1SIE                      176
#define PSMC2SIE                      177
#define PSMC3SIE                      178
#define PSMC1TIE                      179
#define PSMC2TIE                      180
#define PMSC3TIE                      181
#define PSMC3TIE                      182
#define OPTION_REG                    183
#define PS                            184
#define PS0                           185
#define PS1                           186
#define PS2                           187
#define PSA                           188
#define T0SE                          189
#define TMR0SE                        190
#define T0CS                          191
#define TMR0CS                        192
#define INTEDG                        193
#define nWPUEN                        194
#define PCON                          195
#define nBOR                          196
#define nPOR                          197
#define nRI                           198
#define nRMCLR                        199
#define nRWDT                         200
#define STKUNF                        201
#define STKOVF                        202
#define WDTCON                        203
#define SWDTEN                        204
#define WDTPS                         205
#define WDTPS0                        206
#define WDTPS1                        207
#define WDTPS2                        208
#define WDTPS3                        209
#define WDTPS4                        210
#define OSCTUNE                       211
#define TUN0                          212
#define TUN                           213
#define TUN1                          214
#define TUN2                          215
#define TUN3                          216
#define TUN4                          217
#define TUN5                          218
#define OSCCON                        219
#define SCS0                          220
#define SCS                           221
#define SCS1                          222
#define IRCF                          223
#define IRCF0                         224
#define IRCF1                         225
#define IRCF2                         226
#define IRCF3                         227
#define SPLLEN                        228
#define OSCSTAT                       229
#define HFIOFS                        230
#define LFIOFR                        231
#define MFIOFR                        232
#define HFIOFL                        233
#define HFIOFR                        234
#define OSTS                          235
#define PLLR                          236
#define T1OSCR                        237
#define ADRESL                        238
#define ADRESH                        239
#define ADCON0                        240
#define ADON                          241
#define GO_nDONE                      242
#define DONE                          243
#define GO                            244
#define ADGO                          245
#define CHS0                          246
#define CHS                           247
#define CHS1                          248
#define CHS2                          249
#define CHS3                          250
#define CHS4                          251
#define ADRMD                         252
#define ADCON1                        253
#define ADPREF0                       254
#define ADPREF                        255
#define ADPREF1                       256
#define ADNREF                        257
#define ADCS0                         258
#define ADCS                          259
#define ADCS1                         260
#define ADCS2                         261
#define ADFM                          262
#define ADCON2                        263
#define CHSN0                         264
#define CHSN                          265
#define CHSN1                         266
#define CHSN2                         267
#define CHSN3                         268
#define TRIGSEL                       269
#define TRIGSEL0                      270
#define TRIGSEL1                      271
#define TRIGSEL2                      272
#define TRIGSEL3                      273
#define LATA0                         274
#define LATA                          275
#define LATA1                         276
#define LATA2                         277
#define LATA3                         278
#define LATA4                         279
#define LATA5                         280
#define LATA6                         281
#define LATA7                         282
#define LATB0                         283
#define LATB                          284
#define LATB1                         285
#define LATB2                         286
#define LATB3                         287
#define LATB4                         288
#define LATB5                         289
#define LATB6                         290
#define LATB7                         291
#define LATC0                         292
#define LATC                          293
#define LATC1                         294
#define LATC2                         295
#define LATC3                         296
#define LATC4                         297
#define LATC5                         298
#define LATC6                         299
#define LATC7                         300
#define CM1CON0                       301
#define C1SYNC                        302
#define C1HYS                         303
#define C1SP                          304
#define C1ZLF                         305
#define C1POL                         306
#define C1OE                          307
#define C1OUT                         308
#define C1ON                          309
#define CM1CON1                       310
#define C1NCH0                        311
#define C1NCH                         312
#define C1NCH1                        313
#define C1NCH2                        314
#define C1PCH                         315
#define C1PCH0                        316
#define C1PCH1                        317
#define C1PCH2                        318
#define C1INTN                        319
#define C1INTP                        320
#define CM2CON0                       321
#define C2SYNC                        322
#define C2HYS                         323
#define C2SP                          324
#define C2ZLF                         325
#define C2POL                         326
#define C2OE                          327
#define C2OUT                         328
#define C2ON                          329
#define CM2CON1                       330
#define C2NCH0                        331
#define C2NCH                         332
#define C2NCH1                        333
#define C2NCH2                        334
#define C2PCH                         335
#define C2PCH0                        336
#define C2PCH1                        337
#define C2PCH2                        338
#define C2INTN                        339
#define C2INTP                        340
#define CMOUT                         341
#define MC1OUT                        342
#define MC2OUT                        343
#define MC3OUT                        344
#define MC4OUT                        345
#define BORCON                        346
#define BORRDY                        347
#define BORFS                         348
#define SBOREN                        349
#define FVRCON                        350
#define ADFVR0                        351
#define ADFVR                         352
#define ADFVR1                        353
#define CDAFVR0                       354
#define CDAFVR                        355
#define CDAFVR1                       356
#define TSRNG                         357
#define TSEN                          358
#define FVRRDY                        359
#define FVREN                         360
#define DACCON0                       361
#define DACNSS                        362
#define DACPSS                        363
#define DACPSS0                       364
#define DACPSS1                       365
#define DACOE2                        366
#define DACOE1                        367
#define DACEN                         368
#define DACCON1                       369
#define DACR0                         370
#define DACR                          371
#define DACR1                         372
#define DACR2                         373
#define DACR3                         374
#define DACR4                         375
#define DACR5                         376
#define DACR6                         377
#define DACR7                         378
#define CM4CON0                       379
#define C4SYNC                        380
#define C4HYS                         381
#define C4SP                          382
#define C4ZLF                         383
#define C4POL                         384
#define C4OE                          385
#define C4OUT                         386
#define C4ON                          387
#define CM4CON1                       388
#define C4NCH0                        389
#define C4NCH                         390
#define C4NCH1                        391
#define C4NCH2                        392
#define C4PCH0                        393
#define C4PCH                         394
#define C4PCH1                        395
#define C4PCH2                        396
#define C4INTN                        397
#define C4INTP                        398
#define APFCON2                       399
#define CCP3SEL                       400
#define APFCON1                       401
#define CCP2SEL                       402
#define RXSEL                         403
#define TXSEL                         404
#define SDISEL                        405
#define SCKSEL                        406
#define SDOSEL                        407
#define CCP1SEL                       408
#define C2OUTSEL                      409
#define CM3CON0                       410
#define C3SYNC                        411
#define C3HYS                         412
#define C3SP                          413
#define C3ZLF                         414
#define C3POL                         415
#define C3OE                          416
#define C3OUT                         417
#define C3ON                          418
#define CM3CON1                       419
#define C3NCH                         420
#define C3NCH0                        421
#define C3NCH1                        422
#define C3NCH2                        423
#define C3PCH                         424
#define C3PCH0                        425
#define C3PCH1                        426
#define C3PCH2                        427
#define C3INTN                        428
#define C3INTP                        429
#define ANSA0                         430
#define ANSELA                        431
#define ANSA1                         432
#define ANSA2                         433
#define ANSA3                         434
#define ANSA4                         435
#define ANSA5                         436
#define ANSA7                         437
#define ANSB0                         438
#define ANSELB                        439
#define ANSB1                         440
#define ANSB2                         441
#define ANSB3                         442
#define ANSB4                         443
#define ANSB5                         444
#define ANSB6                         445
#define EEADRL                        446
#define EEADRH                        447
#define EEDATL                        448
#define EEDATH                        449
#define EECON1                        450
#define RD                            451
#define WR                            452
#define WREN                          453
#define WRERR                         454
#define FREE                          455
#define LWLO                          456
#define CFGS                          457
#define EEPGD                         458
#define EECON2                        459
#define VREGCON                       460
#define VREGPM                        461
#define RC1REG                        462
#define TX1REG                        463
#define SP1BRGL                       464
#define SP1BRGH                       465
#define RC1STA                        466
#define RX9D                          467
#define OERR                          468
#define FERR                          469
#define ADDEN                         470
#define CREN                          471
#define SREN                          472
#define RX9                           473
#define SPEN                          474
#define TX1STA                        475
#define TX9D                          476
#define TRMT                          477
#define BRGH                          478
#define SENDB                         479
#define SYNC                          480
#define TXEN                          481
#define TX9                           482
#define CSRC                          483
#define BAUD1CON                      484
#define ABDEN                         485
#define WUE                           486
#define BRG16                         487
#define SCKP                          488
#define RCIDL                         489
#define ABDOVF                        490
#define WPUA0                         491
#define WPUA                          492
#define WPUA1                         493
#define WPUA2                         494
#define WPUA3                         495
#define WPUA4                         496
#define WPUA5                         497
#define WPUA6                         498
#define WPUA7                         499
#define WPUB0                         500
#define WPUB                          501
#define WPUB1                         502
#define WPUB2                         503
#define WPUB3                         504
#define WPUB4                         505
#define WPUB5                         506
#define WPUB6                         507
#define WPUB7                         508
#define WPUC0                         509
#define WPUC                          510
#define WPUC1                         511
#define WPUC2                         512
#define WPUC3                         513
#define WPUC4                         514
#define WPUC5                         515
#define WPUC6                         516
#define WPUC7                         517
#define WPUE                          518
#define WPUE3                         519
#define SSP1BUF                       520
#define BUF                           521
