tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1786_tdd.h
#define BUF0                          522
#define SSP1BUF0                      523
#define BUF1                          524
#define SSP1BUF1                      525
#define BUF2                          526
#define SSP1BUF2                      527
#define BUF3                          528
#define SSP1BUF3                      529
#define BUF4                          530
#define SSP1BUF4                      531
#define BUF5                          532
#define SSP1BUF5                      533
#define BUF6                          534
#define SSP1BUF6                      535
#define BUF7                          536
#define SSP1BUF7                      537
#define ADD0                          538
#define ADD                           539
#define SSP1ADD0                      540
#define SSP1ADD                       541
#define ADD1                          542
#define SSP1ADD1                      543
#define ADD2                          544
#define SSP1ADD2                      545
#define ADD3                          546
#define SSP1ADD3                      547
#define ADD4                          548
#define SSP1ADD4                      549
#define ADD5                          550
#define SSP1ADD5                      551
#define ADD6                          552
#define SSP1ADD6                      553
#define ADD7                          554
#define SSP1ADD7                      555
#define SSP1MSK0                      556
#define SSP1MSK                       557
#define MSK0                          558
#define MSK                           559
#define SSP1MSK1                      560
#define MSK1                          561
#define SSP1MSK2                      562
#define MSK2                          563
#define SSP1MSK3                      564
#define MSK3                          565
#define SSP1MSK4                      566
#define MSK4                          567
#define SSP1MSK5                      568
#define MSK5                          569
#define SSP1MSK6                      570
#define MSK6                          571
#define SSP1MSK7                      572
#define MSK7                          573
#define SSP1STAT                      574
#define BF                            575
#define UA                            576
#define R_nW                          577
#define S                             578
#define P                             579
#define D_nA                          580
#define CKE                           581
#define SMP                           582
#define SSP1CON1                      583
#define SSPM0                         584
#define SSPM                          585
#define SSPM1                         586
#define SSPM2                         587
#define SSPM3                         588
#define CKP                           589
#define SSPEN                         590
#define SSPOV                         591
#define WCOL                          592
#define SSP1CON2                      593
#define SEN                           594
#define RSEN                          595
#define PEN                           596
#define RCEN                          597
#define ACKEN                         598
#define ACKDT                         599
#define ACKSTAT                       600
#define GCEN                          601
#define SSP1CON3                      602
#define DHEN                          603
#define AHEN                          604
#define SBCDE                         605
#define SDAHT                         606
#define BOEN                          607
#define SCIE                          608
#define PCIE                          609
#define ACKTIM                        610
#define ODCONA0                       611
#define ODCONA                        612
#define ODCONA1                       613
#define ODCONA2                       614
#define ODCONA3                       615
#define ODCONA4                       616
#define ODCONA5                       617
#define ODCONA6                       618
#define ODCONA7                       619
#define ODCONB0                       620
#define ODCONB                        621
#define ODCONB1                       622
#define ODCONB2                       623
#define ODCONB3                       624
#define ODCONB4                       625
#define ODCONB5                       626
#define ODCONB6                       627
#define ODCONB7                       628
#define ODCONC0                       629
#define ODCONC                        630
#define ODCONC1                       631
#define ODCONC2                       632
#define ODCONC3                       633
#define ODCONC4                       634
#define ODCONC5                       635
#define ODCONC6                       636
#define ODCONC7                       637
#define CCPR1L                        638
#define CCPR1H                        639
#define CCP1CON                       640
#define CCP1M0                        641
#define CCP1M                         642
#define CCP1M1                        643
#define CCP1M2                        644
#define CCP1M3                        645
#define DC1B                          646
#define DC1B0                         647
#define DC1B1                         648
#define CCPR2L                        649
#define CCPR2H                        650
#define CCP2CON                       651
#define CCP2M                         652
#define CCP2M0                        653
#define CCP2M1                        654
#define CCP2M2                        655
#define CCP2M3                        656
#define DC2B0                         657
#define DC2B                          658
#define DC2B1                         659
#define SLRCONA0                      660
#define SLRCONA                       661
#define SLRCONA1                      662
#define SLRCONA2                      663
#define SLRCONA3                      664
#define SLRCONA4                      665
#define SLRCONA5                      666
#define SLRCONA6                      667
#define SLRCONA7                      668
#define SLRCONB                       669
#define SLRCONB0                      670
#define SLRCONB1                      671
#define SLRCONB2                      672
#define SLRCONB3                      673
#define SLRCONB4                      674
#define SLRCONB5                      675
#define SLRCONB6                      676
#define SLRCONB7                      677
#define SLRCONC                       678
#define SLRCONC0                      679
#define SLRCONC1                      680
#define SLRCONC2                      681
#define SLRCONC3                      682
#define SLRCONC4                      683
#define SLRCONC5                      684
#define SLRCONC6                      685
#define SLRCONC7                      686
#define CCPR3L                        687
#define CCPR3H                        688
#define CCP3CON                       689
#define CCP3M                         690
#define CCP3M0                        691
#define CCP3M1                        692
#define CCP3M2                        693
#define CCP3M3                        694
#define DC3B                          695
#define DC3B0                         696
#define DC3B1                         697
#define INLVLA                        698
#define INLVLA0                       699
#define INLVLA1                       700
#define INLVLA2                       701
#define INLVLA3                       702
#define INLVLA4                       703
#define INLVLA5                       704
#define INLVLA6                       705
#define INLVLA7                       706
#define INLVLB                        707
#define INLVLB0                       708
#define INLVLB1                       709
#define INLVLB2                       710
#define INLVLB3                       711
#define INLVLB4                       712
#define INLVLB5                       713
#define INLVLB6                       714
#define INLVLB7                       715
#define INLVLC                        716
#define INLVLC0                       717
#define INLVLC1                       718
#define INLVLC2                       719
#define INLVLC3                       720
#define INLVLC4                       721
#define INLVLC5                       722
#define INLVLC6                       723
#define INLVLC7                       724
#define INLVLE                        725
#define INLVLE3                       726
#define IOCAP                         727
#define IOCAP0                        728
#define IOCAP1                        729
#define IOCAP2                        730
#define IOCAP3                        731
#define IOCAP4                        732
#define IOCAP5                        733
#define IOCAP6                        734
#define IOCAP7                        735
#define IOCAN                         736
#define IOCAN0                        737
#define IOCAN1                        738
#define IOCAN2                        739
#define IOCAN3                        740
#define IOCAN4                        741
#define IOCAN5                        742
#define IOCAN6                        743
#define IOCAN7                        744
#define IOCAF0                        745
#define IOCAF                         746
#define IOCAF1                        747
#define IOCAF2                        748
#define IOCAF3                        749
#define IOCAF4                        750
#define IOCAF5                        751
#define IOCAF6                        752
#define IOCAF7                        753
#define IOCBP                         754
#define IOCBP0                        755
#define IOCBP1                        756
#define IOCBP2                        757
#define IOCBP3                        758
#define IOCBP4                        759
#define IOCBP5                        760
#define IOCBP6                        761
#define IOCBP7                        762
#define IOCBN0                        763
#define IOCBN                         764
#define IOCBN1                        765
#define IOCBN2                        766
#define IOCBN3                        767
#define IOCBN4                        768
#define IOCBN5                        769
#define IOCBN6                        770
#define IOCBN7                        771
#define IOCBF0                        772
#define IOCBF                         773
#define IOCBF1                        774
#define IOCBF2                        775
#define IOCBF3                        776
#define IOCBF4                        777
#define IOCBF5                        778
#define IOCBF6                        779
#define IOCBF7                        780
#define IOCCP0                        781
#define IOCCP                         782
#define IOCCP1                        783
#define IOCCP2                        784
#define IOCCP3                        785
#define IOCCP4                        786
#define IOCCP5                        787
#define IOCCP6                        788
#define IOCCP7                        789
#define IOCCN0                        790
#define IOCCN                         791
#define IOCCN1                        792
#define IOCCN2                        793
#define IOCCN3                        794
#define IOCCN4                        795
#define IOCCN5                        796
#define IOCCN6                        797
#define IOCCN7                        798
#define IOCCF0                        799
#define IOCCF                         800
#define IOCCF1                        801
#define IOCCF2                        802
#define IOCCF3                        803
#define IOCCF4                        804
#define IOCCF5                        805
#define IOCCF6                        806
#define IOCCF7                        807
#define IOCEP                         808
#define IOCEP3                        809
#define IOCEN                         810
#define IOCEN3                        811
#define IOCEF                         812
#define IOCEF3                        813
#define OPA1CON                       814
#define OPA1CON_PCH                   815
#define OPA1PCH                       816
#define OPA1CON_PCH0                  817
#define OPA1PCH0                      818
#define OPA1CON_PCH1                  819
#define OPA1PCH1                      820
#define OPA1CON_SP                    821
#define OPA1SP                        822
#define OPA1CON_EN                    823
#define OPA1EN                        824
#define OPA2CON                       825
#define OPA2CON_PCH                   826
#define OPA2CON_PCH0                  827
#define OPA2PCH                       828
#define OPA2PCH0                      829
#define OPA2CON_PCH1                  830
#define OPA2PCH1                      831
#define OPA2CON_SP                    832
#define OPA2SP                        833
#define OPA2EN                        834
#define OPA2CON_EN                    835
#define CLKRCON                       836
#define CLKRDIV                       837
#define CLKRDIV0                      838
#define CLKRDIV1                      839
#define CLKRDIV2                      840
#define CLKRDC                        841
#define CLKRDC0                       842
#define CLKRDC1                       843
#define CLKRSLR                       844
#define CLKROE                        845
#define CLKREN                        846
#define PSMC1CON                      847
#define P1MODE                        848
#define P1MODE0                       849
#define P1MODE1                       850
#define P1MODE2                       851
#define P1MODE3                       852
#define P1DBRE                        853
#define P1DBFE                        854
#define PSMC1LD                       855
#define PSMC1EN                       856
#define PSMC1MDL                      857
#define P1MSRC0                       858
#define P1MSRC                        859
#define P1MSRC1                       860
#define P1MSRC2                       861
#define P1MSRC3                       862
#define P1MDLBIT                      863
#define P1MDLPOL                      864
#define P1MDLEN                       865
#define PSMC1SYNC                     866
#define P1SYNC0                       867
#define P1SYNC1                       868
#define P1SYNC2                       869
#define P1DCPOL                       870
#define P1PRPOL                       871
#define P1POFST                       872
#define PSMC1CLK                      873
#define P1CSRC                        874
#define P1CSRC0                       875
#define P1CSRC1                       876
#define P1CPRE                        877
#define P1CPRE0                       878
#define P1CPRE1                       879
#define PSMC1OEN                      880
#define P1OEA                         881
#define P1OEB                         882
#define P1OEC                         883
#define P1OED                         884
#define P1OEE                         885
#define P1OEF                         886
#define PSMC1POL                      887
#define P1POLA                        888
#define P1POLB                        889
#define P1POLC                        890
#define P1POLD                        891
#define P1POLE                        892
#define P1POLF                        893
#define P1INPOL                       894
#define PSMC1BLNK                     895
#define P1REBM                        896
#define P1REBM0                       897
#define P1REBM1                       898
#define P1FEBM0                       899
#define P1FEBM                        900
#define P1FEBM1                       901
#define PSMC1REBS                     902
#define P1REBSC1                      903
#define P1REBSC2                      904
#define P1REBSC3                      905
#define P1REBSC4                      906
#define P1REBSIN                      907
#define PSMC1FEBS                     908
#define P1FEBSC1                      909
#define P1FEBSC2                      910
#define P1FEBSC3                      911
#define P1FEBSC4                      912
#define P1FEBSIN                      913
#define PSMC1PHS                      914
#define P1PHST                        915
#define P1PHSC1                       916
#define P1PHSC2                       917
#define P1PHSC3                       918
#define P1PHSC4                       919
#define P1PHSIN                       920
#define PSMC1DCS                      921
#define P1DCST                        922
#define P1DCSC1                       923
#define P1DCSC2                       924
#define P1DCSC3                       925
#define P1DCSC4                       926
#define P1DCSIN                       927
#define PSMC1PRS                      928
#define P1PRST                        929
#define P1PRSC1                       930
#define P1PRSC2                       931
#define P1PRSC3                       932
#define P1PRSC4                       933
#define P1PRSIN                       934
#define PSMC1ASDC                     935
#define P1ASDOV                       936
#define P1ARSEN                       937
#define P1ASDEN                       938
#define P1ASE                         939
#define PSMC1ASDL                     940
#define P1ASDLA                       941
#define P1ASDLB                       942
#define P1ASDLC                       943
#define P1ASDLD                       944
#define P1ASDLE                       945
#define P1ASDLF                       946
#define PSMC1ASDS                     947
#define P1ASDSC1                      948
#define P1ASDSC2                      949
#define P1ASDSC3                      950
#define P1ASDSC4                      951
#define P1ASDSIN                      952
#define PSMC1INT                      953
#define P1TPRIF                       954
#define P1TDCIF                       955
#define P1TPHIF                       956
#define P1TOVIF                       957
#define P1TPRIE                       958
#define P1TDCIE                       959
#define P1TPHIE                       960
#define P1TOVIE                       961
#define PSMC1PHL                      962
#define PSMC1PH0                      963
#define PSMC1PH1                      964
#define PSMC1PH2                      965
#define PSMC1PH3                      966
#define PSMC1PH4                      967
#define PSMC1PH5                      968
#define PSMC1PH6                      969
#define PSMC1PH7                      970
#define PSMC1PHH                      971
#define PSMC1PH8                      972
#define PSMC1PH9                      973
#define PSMC1PH10                     974
#define PSMC1PH11                     975
#define PSMC1PH12                     976
#define PSMC1PH13                     977
#define PSMC1PH14                     978
#define PSMC1PH15                     979
#define PSMC1DCL                      980
#define PSMC1DC0                      981
#define PSMC1DC1                      982
#define PSMC1DC2                      983
#define PSMC1DC3                      984
#define PSMC1DC4                      985
#define PSMC1DC5                      986
#define PSMC1DC6                      987
#define PSMC1DC7                      988
#define PSMC1DCH                      989
#define PSMC1DC8                      990
#define PSMC1DC9                      991
#define PSMC1DC10                     992
#define PSMC1DC11                     993
#define PSMC1DC12                     994
#define PSMC1DC13                     995
#define PSMC1DC14                     996
#define PSMC1DC15                     997
#define PSMC1PRL                      998
#define PSMC1PR0                      999
#define PSMC1PR1                      1000
#define PSMC1PR2                      1001
#define PSMC1PR3                      1002
#define PSMC1PR4                      1003
#define PSMC1PR5                      1004
#define PSMC1PR6                      1005
#define PSMC1PR7                      1006
#define PSMC1PRH                      1007
#define PSMC1PR8                      1008
#define PSMC1PR9                      1009
#define PSMC1PR10                     1010
#define PSMC1PR11                     1011
#define PSMC1PR12                     1012
#define PSMC1PR13                     1013
#define PSMC1PR14                     1014
#define PSMC1PR15                     1015
#define PSMC1TMRL                     1016
#define PSMC1TMR0                     1017
#define PSMC1TMR1                     1018
#define PSMC1TMR2                     1019
#define PSMC1TMR3                     1020
#define PSMC1TMR4                     1021
#define PSMC1TMR5                     1022
#define PSMC1TMR6                     1023
#define PSMC1TMR7                     1024
#define PSMC1TMRH                     1025
#define PSMC1TMR8                     1026
#define PSMC1TMR9                     1027
#define PSMC1TMR10                    1028
#define PSMC1TMR11                    1029
#define PSMC1TMR12                    1030
#define PSMC1TMR13                    1031
#define PSMC1TMR14                    1032
#define PSMC1TMR15                    1033
#define PSMC1DBR                      1034
#define PSMC1DBR0                     1035
#define PSMC1DBR1                     1036
#define PSMC1DBR2                     1037
#define PSMC1DBR3                     1038
#define PSMC1DBR4                     1039
#define PSMC1DBR5                     1040
#define PSMC1DBR6                     1041
#define PSMC1DBR7                     1042
#define PSMC1DBF                      1043
#define PSMC1DBF0                     1044
#define PSMC1DBF1                     1045
#define PSMC1DBF2                     1046
#define PSMC1DBF3                     1047
#define PSMC1DBF4                     1048
#define PSMC1DBF5                     1049
#define PSMC1DBF6                     1050
#define PSMC1DBF7                     1051
#define PSMC1BLKR                     1052
#define PSMC1BLKR0                    1053
#define PSMC1BLKR1                    1054
#define PSMC1BLKR2                    1055
#define PSMC1BLKR3                    1056
#define PSMC1BLKR4                    1057
#define PSMC1BLKR5                    1058
#define PSMC1BLKR6                    1059
#define PSMC1BLKR7                    1060
#define PSMC1BLKF                     1061
#define PSMC1BLKF0                    1062
#define PSMC1BLKF1                    1063
#define PSMC1BLKF2                    1064
#define PSMC1BLKF3                    1065
#define PSMC1BLKF4                    1066
#define PSMC1BLKF5                    1067
#define PSMC1BLKF6                    1068
#define PSMC1BLKF7                    1069
#define PSMC1FFA                      1070
#define PSMC1FFA0                     1071
#define PSMC1FFA1                     1072
#define PSMC1FFA2                     1073
#define PSMC1FFA3                     1074
#define PSMC1STR0                     1075
#define P1STRA                        1076
#define P1STRB                        1077
#define P1STRC                        1078
#define P1STRD                        1079
#define P1STRE                        1080
#define P1STRF                        1081
#define PSMC1STR1                     1082
#define P1HSMEN                       1083
#define P1LSMEN                       1084
#define P1SSYNC                       1085
#define PSMC2CON                      1086
#define P2MODE                        1087
#define P2MODE0                       1088
#define P2MODE1                       1089
#define P2MODE2                       1090
